app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.find(session[:id]) if session[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]