app/controllers/cards_controller.rb

  def index
    @deck = Deck.find(params[:deck_id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def new
    @deck = Deck.find(params[:deck_id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]