app/controllers/decks_controller.rb

  def create
    @deck = Deck.new(deck_params)
    @deck.user = current_user
    @deck.created_by = current_user

    if @deck.save
---
INSERT INTO "decks" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asd"], ["description", "sdfds"], ["user_id", 1], ["created_at", "2018-08-16 00:00:20.156007"], ["updated_at", "2018-08-16 00:00:20.156007"]]

  def show
    @deck = Deck.find(params[:id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def edit
    @deck = Deck.find(params[:id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @deck = Deck.find(params[:id])

    @deck.update_attributes(deck_params)
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "decks" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "decks"."id" = $4  [["name", "qq"], ["description", "asdfasdf"], ["updated_at", "2018-08-16 01:09:12.860809"], ["id", 3]]

  def destroy
    @deck = Deck.find(params[:id])
    @deck.destroy
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "decks" WHERE "decks"."id" = $1  [["id", 6]]