app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "max@max.com"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: params[:login][:email].downcase)