app/views/decks/show.html.erb

    <td>Number of cards</td>
    <td><%= @deck.cards.count %></td>
---
SELECT COUNT(*) FROM "cards" WHERE "cards"."deck_id" = $1  [["deck_id", 1]]